[
  "Good Afternoon! How is your day going?",
  "When are you going to be starting to work?",
  "What type of car are you thinking of?",
  "An S3 Sedan costs $53,590. Insurance would be $2,100, plus $120 for registration, and $50 for gas per week",
  "Based on cross-data, the average person your age spends $12.5 a day on parking downtown.",
  "Let me take a look at your expense history..... I noticed you spend $58 dollars more than usual last month on coffee, and $120 more than usual on eating out.",
  "Also, it seems that three quarters of people in your age group start looking for housing within 5 years of starting full time work. Do you think that you will need a house in 5 years?",
  "That is a lot of money to spend then! Let us think about some alternative options: Using public transport, or buying a used car! How about this one: https://www.autotrader.ca/a/audi/a3/\nmississauga/ontario\npc=M4B%201B5&sprx=100 ",
  "To reach this goal, you must reduce your coffee spending to $23 a month! And limit take-out to $42 a month :( Additionally, I would suggest you to consider RBCs Guaranteed return GICs for your monthly income: https://www.rbcroyalbank.com/gics.html. If you would like, I can connect you over a call to discuss more.",
  "Yeah sure, let me make a quick analysis for you based on the products available and your required target.\nSo you have 8 investment options with RBC. Based on ROI analysis I sent you as an attachment, the best option for you is RBCs smart market GICs. It lets you achieve your goals and you can also avail the current offer of waiver of fees, since you are a valued customer :-)",
  "Hey Meghan, do you want to hear a good deal I have for you?",
	"I notice you have 5,000 points accumulated on your RBC reward program and you havent used it so far. 2,000 points will expire by the end of this month, so it would be a good idea to start planning redeeming it.",
	"Also, based on your historic spendings, I suspect this is time for you to plan that special dinner with your love on Valentines Day.",
	"Are you still with me?",
	"Based on what I know from your habits, I know that you appreciate japanese food. We have a partnership with Kasa Moto and I assume this is one of your preferred one, right? You have been there a couple of times. On this special offer, you can redeem 3,000 points for a dinner for two.",
	"If it does not make sense for you, your peer clients are also giving good reviews from Kinka Izakaya. You can redeem the same 3,000 points for a dinner for two. If it does not work, let me know what is your need and I can help you find a good deal and not losing your points.",
	"Awesome! Do you confirm we can redeem 3,000 points for a dinner at Kasa Moto?",
	"Cool. I will send you all the details by email. Have a nice day!"

]